app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Excellent!"], ["rating", 4], ["product_id", 1], ["user_id", 1], ["created_at", "2016-06-04 00:19:50.740258"], ["updated_at", "2016-06-04 00:19:50.740258"]]
---
	def create
		@product = Product.find(params[:product_id])
	    @comment = @product.comments.new(comment_params)
	    @comment.user = current_user
	    @comment.save