app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%Wacky%')
SELECT "products".* FROM "products"
---
def index
  if params[:q]
    search_term = params[:q]


    if Rails.env.production?
        @products = Product.where("name ILIKE ?", "%#{search_term}%")
    else
        @products = Product.where("name LIKE ?", "%#{search_term}%")
    end


  else
    @products = Product.all

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 2 OFFSET 0  [["product_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
      #@comments = @product.comments.order("created_at DESC")
      #Post.paginate(:page => params[:page], :per_page => 2)
      #@comments = Comment.paginate(:page => params[:page])
      #Comment.paginate(:page => params[:page], :per_page => 10)
       ## @comments = Comment.paginate(:page => params[:page])
      @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 2)

INSERT INTO "products" ("name", "description", "image_url", "colour", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Whimsy"], ["description", ""], ["image_url", ""], ["colour", "Pink"], ["created_at", "2016-05-19 17:47:30.699571"], ["updated_at", "2016-05-19 17:47:30.699571"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "For environmentalists and tree huggers."], ["updated_at", "2016-04-28 00:59:49.773190"], ["id", 2]]
---
  def update

#byebug

    respond_to do |format|
      if @product.update(product_params)