app/controllers/static_pages_controller.rb

   def landing_page
   #def index
     # @products = Product.limit(3)
      @products = Product.all
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1