app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Brian"], ["last_name", "Lee"], ["updated_at", "2016-05-31 02:36:37.900782"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)